
"""
Convert Number to Thai Text.
เขียนโปรแกรมรับค่าจาก user เพื่อแปลง input ของ user ที่เป็นตัวเลข เป็นตัวหนังสือภาษาไทย
โดยที่ค่าที่รับต้องมีค่ามากกว่าหรือเท่ากับ 0 และน้อยกว่า 10 ล้าน

*** อนุญาตให้ใช้แค่ตัวแปรพื้นฐาน, built-in methods ของตัวแปรและ function พื้นฐานของ Python เท่านั้น
ห้ามใช้ Library อื่น ๆ ที่ต้อง import ในการทำงาน(ยกเว้น ใช้เพื่อการ test การทำงานของฟังก์ชัน).

"""
# ทำได้ถึงหลัก 0-9999


# รับค่า เป็น int
numberInput = int(input("Enter Your Number : ")) 

# สร้างฟังก์ชั่น Convert Number to Thai Text ตั้งแต่ 1-999
def num1_100(numberInput): 

    # ประกาศตัวแปรเป็น list เก็บค่า ตัวหนังสือ
    text1_10 = ['','หนึ่ง', 'สอง', 'สาม', 'สี่', 'ห้า', 'หก', 'เจ็ด', 'แปด', 'เก้า']
    text11_19 = ['','สิบเอ็ด', 'สิบสอง', 'สิบสาม', 'สิบสี่', 'สิบห้า', 'สิบหก', 'สิบเจ็ด', 'สิบแปด', 'สิบเก้า']
    text10_100 = ['','สิบ', 'ยี่สิบ', 'สามสิบ', 'สี่สิบ', 'ห้าสิบ', 'หกสิบ', 'เจ็ดสิบ', 'แปดสิบ', 'เก้าสิบ']

    # ทำการหารเพื่อเอาตัวเลขของแต่ละหลัก คือ หลักหน่วย หลักสิบ หลักร้อย
    u = numberInput%10 #หารเอาเศษ 11/10 = 1
    t = (numberInput//10)%10  # 123 >> n//10 >> 12 >> 12%10 >> 2
    h = (numberInput//100)%10 # 123 >> n//100 >> 1 >> 1%10 >> 1

    # ประกาศตัวแปร result เป็น List ว่างๆ ไว้รับค่า
    result = [] 

    # เริ่มเช็คที่หลักร้อยก่อนถ้าตัวแปรที่เก็บหลักร้อยไม่เท่ากับ 0 ให้คำสั่งทำงานโดยเก็บค่า List text1_10[ตำแหน่งที่(h)] ไว้ในตัวแปร result
    if h >0:
        result.append(text1_10[h])
        result.append('ร้อย')

    # เริ่มเช็คที่หลักสิบต่อถ้าตัวแปรที่เก็บหลักสิบเท่ากับ 1 ให้คำสั่งต่อไปทำงาน แสดงว่าค่าจะอยู่ในช่วง 10-19
    if t == 1 :

        # เช็คที่หลักหน่วยต่อถ้าตัวแปรที่เก็บหลักหน่วยเท่ากับ 0 ให้คำสั่งทำงาน เก็บค่า List text10_100[ตำแหน่งที่ 1]
        if u == 0:
            result.append(text10_100[1])

        # ถ้าไม่ตรงตามเงื่อนไขด้านบน ให้ทำคำสั่ง เก็บค่า List text11_19[ตำแหน่งที่ u(หลักหน่วย)] 
        else:
            result.append(text11_19[u])

    # เช็คที่หลักสิบต่อถ้าตัวแปรที่เก็บหลักสิบมากกว่า 1 ให้คำสั่งต่อไปทำงาน แสดงว่าค่าจะอยู่ในช่วง 20-99
    elif t > 1 :
        result.append(text10_100[t])

        # ทำการเช็คว่าหลักหน่วยมีค่ามากกว่า 0 หรือไม่ ถ้าไม่ให้ result เก็บค่าเข้าไปใน list เพิ่ม List text1_10[ตำแหน่งที่ u(หลักหน่วย)]
        if u > 0 :
            result.append(text1_10[u])

    # (หลักหน่วย)ถ้าเกิดไม่ตรงตามเงื่อนไขทั้งหมด ให้คำสั่งด้านล่าง
    else:
        
        # เช็คค่าหลักหน่วยว่าทีค่า มากกว่า 0 หรือไม่ ถ้าใช่ให้ทำการเก็บ List text1_10[ตำแหน่งที่ u(หลักหน่วย)]
        if u > 0 :
            result.append(text1_10[u])

    # ทำการ Return ค่า result กลับไป
    return result 


def num1k_10M(numberInput):

    text_1k_10M = ['','พัน','หมื่น','แสน','ล้าน','สิบล้าน'] 
    result = []
    i = 0

    if numberInput == 0 :
        return 'ศูนย์'

    while numberInput > 0 : 
        num = numberInput%1000
        text_number = num1_100(num) 

        if num > 0:
            text_number.append(text_1k_10M[i])
        text_number.extend(result)
        result = text_number
        i += 1
        numberInput //= 1000        

    return  "".join(result)

if numberInput >= 0 and numberInput <= 10000000 :
    print(num1k_10M(numberInput))
else:
    exit()


    